{"architecture":{"class_name":"Functional","config":{"name":"sequential_103","trainable":true,"layers":[{"module":"keras.layers","class_name":"InputLayer","config":{"batch_input_shape":[null,40,4],"dtype":"float32","sparse":false,"ragged":false,"name":"input_1"},"registered_name":null,"name":"input_1","inbound_nodes":[]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_283","trainable":true,"dtype":"float32","units":20,"activation":"tanh","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,40,4]},"name":"dense_283","inbound_nodes":[[["input_1",0,0,{}]]]},{"module":"keras.layers","class_name":"LSTM","config":{"name":"lstm_112","trainable":true,"dtype":"float32","return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"time_major":false,"units":5,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"RandomNormal","config":{"mean":0.0,"stddev":0.05,"seed":null},"registered_name":null},"recurrent_initializer":{"module":"keras.initializers","class_name":"Orthogonal","config":{"gain":1.0,"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"unit_forget_bias":true,"kernel_regularizer":{"module":"keras.regularizers","class_name":"L1L2","config":{"l1":0.0,"l2":0.0},"registered_name":null},"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"implementation":2},"registered_name":null,"build_config":{"input_shape":[null,40,20]},"name":"lstm_112","inbound_nodes":[[["dense_283",0,0,{}]]]},{"module":"keras.layers","class_name":"Activation","config":{"name":"activation_112","trainable":true,"dtype":"float32","activation":"tanh"},"registered_name":null,"build_config":{"input_shape":[null,5]},"name":"activation_112","inbound_nodes":[[["lstm_112",0,0,{}]]]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_284","trainable":true,"dtype":"float32","units":10,"activation":"tanh","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,5]},"name":"dense_284","inbound_nodes":[[["activation_112",0,0,{}]]]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_285","trainable":true,"dtype":"float32","units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,10]},"name":"dense_285","inbound_nodes":[[["dense_284",0,0,{}]]]}],"input_layers":[["input_1",0,0]],"output_layers":[["dense_285",0,0]]},"keras_version":"2.13.1","backend":"tensorflow"},"image_data_format":"channels_last","input_shapes":[[40,4]],"output_shapes":[[1]],"tests":[{"inputs":[{"shape":[40,4],"values":["dJpHP51Rwr9U/MK/KggWvn7bcb861HW/4ZMDQIcoaL+QkdS+5vAKP5/F6TyVbQ69LozoPyLxaz/0H3K/Fwe/PxQSFb/8Aio/nTZ0PbqQrr+yl2A/c6oRP4hInT8mI6a9hbMZv6Eyf7/EENq8mSSDvqsphD9jMU2+gC2LPwUh+L/JrJs/fVgBv1aAGUBqZbq/1DMEwLTgEz9vLbm/1o5nvmcVJj4XVpW/8IBcvwkMwj5OANE+ay+9v16/QMCg8Vy/cMYSP8bF5r7V/pW9QwxjP2kADb/0u7O+33+UPx3Nxz5BTc2+nzBqvxWFoD+tflo+JCQvwLqU9j7rlGq/gmTrPhT6c7689Ku9SnABQEIXHb8QlTC/i5pwv7Sl5z+Sioa/6R0fPjO3sD+7wze/eHEuP7abWL8uKuY/U3S3v3sJYEDvCXM/E6+9v0VKlT/P5ec9IJByPpjYgD5qfEu/ij+UvUy73j8lEli+x3iFv5JxxT79Pg8/QBaQvO7Ppj+leNM/ZXDYPpuv075409K/FbHSP9InkT4jvcg9e/SwvbAgQ79SRQc+/dsKwIEFHL/oSH6/IcfFP6Rvgz+CAaU/zmcfv6Sr/j7767G/VXPvv/gylz8o+6S/C+MSOygfFT+weFc/c/RIvlZsPkAdnJ0/GK0rP2Qb2T16kkK+tHdWv9exQD+euDe/fNJ+v8+qTr9XFX++tUthvPwKAz8AE529Z00zvyG9uT5AUEk/laRtv62A/L7eLxs+d5NJPkHxgz/LKAu/FAVxPhosCEDyYhq/6B8Pvh9b8D6xHI6/O8q6PxNYCb/GTJm+iqVzvoubXL9zRMo/Te8wPyqxBsBdjzW/1/xWPg=="]}],"outputs":[{"shape":[1],"values":["6OGOQg=="]}]}],"trainable_params":{"dense_283":{"weights":["5jW0vsO5MT9GNY48rXPCvZ38Hb+eO3M+QGnHvpGEkzyfQq++eiwLv3QQ2r4UOr2+WIxbPm7J3r0yaT097/w7vtR5g76Mvdk+b+G6Plas0T7vO7o/yNhmPk1TbrxRvTG9LxaRP0l+kjzujBG+yB8WvyIXHT7LSJK881lhvqPKgr+Szdk9nVqlPoHfhb//8GA+DiWGP7EP2D+M+oE7/WOmPVupjb67JAU/yDPvPqnjwr4Sjmu+XboqPRTguL1s9vu+FiTTvrvTij7Et1q+hC4Uv4a9Tj7b1Km/r+qKPpZqGr2GqS89s2FHPRjm5D7r2KW+Ned1v/PQKD+3n6G+SuokPcmVDD9VoRO9b4G1vnsOB73r364+M+ooPRt6p78oULM+GDwavukVzL6+IRQ8xnZ/vfe2CT/ICLS+Uc8APkhBET0="],"bias":["OQKvvk1iQL9LFTU/izbcvJhFGj/orF2+7/tqvlTNu71Ig5q+lkuyPQO4Uz+gkLQ+g6GavJT6AT+WRDG9DL39PjXDtb7ybCu+PSkNP3e0mr4="]},"lstm_112":{"weights":["AqJvPm3adj7R1wC+RztsvUirgT4TnUi+jm6FPhOY4L1/Mza+78Q5vumLvL2XNKm9rsucvJuKwT13nAs9cccGPvzVTD3mhPS95iKZvsV5Yb/ZJNE+QC3ePjvgGb5XJ34+/xQvPQ7kkz7N//2+hYOXvq4gwz3Qan4+Om6SvsIQlD0dlWW9WYakPVHCTb3IMLU+4RICvVbS4zrff44+XnydPdnZdr4/EqG+oc9CvgZT5L5uMI++obimPiHm+j7WQQW+gv4xP2+Wg70Laoe92JlXveM9Tj6Hi08+9g4lvvnpmr3gT2W8MQhHvmE9Ir+fTto+iFguPgqB771hI0G8jwU1P+v6Dr7SFmS+VxuoPi7PuD0qiB295ufGPBIxaL2brz68Xa2NvUC4ib4iNeM5fz6PvqYEYj2MH+K+26VJv5Ste75eK9C687KkvkRFPb4/VGy+9v27vtPKzz47cwk+Py/0vJeYrrwRnmu9tb8ivpiGlT1MmGM8KXVtPUmeT7xUZDK+A9MpvVBPWTte9hE+tT8YPv9tcj6ZVn8+AU6fPrl8Qz4yyaQ+OYwVvvoDvbwJrU2+WHOqPug+ej5TgAs+IQXfPdblBj6bm0A5qes5Pm/z+T1zKLU+D/5OP9s0OT/boLi9eHA6PglVRT6voZE+PZjQPSUxpD4tJYC+JKJpPpnjnDx6Zpy+/QEwvvnFZL1r1JS+wl1KvmCg3zwkE6G9H95TvPZ2Qrw4Mim+Rj8/vve6w79F6S8+1ZUPPnKbwj4AfoQ+e5KqPgRq4L3CRMq9QegSvn89tz3TIwo+3gBsPXPfPL0dnG29wHUFvpQqyr1ua5K9hucPvR4FWr7rNaE9OyM0v5Gmij7ZOuI+7Qg/PrIACD5UgoQ+ftGGvnp1Vb6y3lO9xtwOvlNUCT4E8A49osRkvlACgL69eLu8Yz/HOUw5JL73L2e+rKXUvXIfrT1vF8e+mEg0vs6khz5TbKS+wqofv1W0NL7A+oa9KII5PjdKZz78Nkm/A2uDv9/97L1/N7y9","MZxIPtPd6b1dRK69S3g3vjT8s7121uq+40QXPo4cTr4qSlO+9k9tv1Rs7b62B0C+NyBhPT9cdD20IQY/mfUmvgrZXL0jZ789qE6pvWWCYb2jng++UFCCvPrTtD15gUO+M2NGPVg0r75PaQq+vekzvwEJ1D1VIgm9wknJvofAA7/uhVu+blGxPiydpD0S+K+9L91zPICW6D1nWIG9jjhuPDFOn7xSoOy6BQIIPkb76j1XZPC9s6fIvZvlo760zI4+5UeVviu3wL3/4IY+DAfCvTgpMz6BAiC9vZPoPSM+TT6b6/8+lSQLvoYm8z0bblE+7nmjO0vriL0jH6o8nnBCPoRwCj5Xks4+m34zvkhveL3Xl129U0aavmtCLb40fQ89IcGSvOq4r76PcAk/IQ1uvhU2pz1hjku9k7GxPFhfsT1p9ue72vS9PczzFL6FpdK82ocAP6m/3b54q9k9ilMkPtE7wj69nBY9ADKDPvYooT8eobe9JZ0QvwaZmD4MbFc9ItrQPcDIDT9fuqO9fHZkvc77zb4tIJa9oZ6hvI331r2F+1Q+New6PWZuED527zI/ArCSvqeivb5Uh6W+L80Lvyda874iShM+bX1oPpAiGz9zQqg+qsGJvnUllb3KRsm6kaIAvjCh8D211na+Wk8DPTm+g70V3qy94aMPv8J0Ub7HDx0+LA2lPa8BK70L6TO9w5w0vjEZGz8C+bO+Hkdmvq8yur3+Cle+M36Yvc8hojzx+/o70QNLvSJtU7raHEi8W027vVYhoD7rU2E9XdeyP6cEuL4OThk+3RG/vFb4wj2zpZc+8vTBvqjdL77xTXm+o5YsPmNZ074i6Q0+szbzvaunFru1RIm+3H5dPXhEhL3ZrBg9pHOMvmGUljyS0bW954Gsvg0m8L63z5y+vvxovgWa4r6P3rU+cNcRPsYUuz22CbU9a5/UvXtzbTwqZBg98uk7Pf8NijrnHgO5LdQevQ0QnL0L8xA+g2xiuzFfLz+09UU+7Ej1vX994D6LIUs/","pj+nPoiVjL3Gd6u+z8lXvRX2oT7jVNQ+OvHUPQSelD3VzBi+dqGrPS1bOz7AZc09V7/1vbi3gD6I0tM+6bX0PQ=="],"recurrent_weights":["2XKJPub31T70eTg/n6i9Pn1Xnj4qckG+rRaMuoMXQb0yp1Q+6e4EP/6lab04N3q+QXRlPpAVY76s3os84YsnPxwWGj+hEh0/A9ctP7pwtbwJQA6/qJzOvkEZQT3TP2q/BTFDv06i8j5kLcA+jdixPqb5nz20l8g+kE/QPpB05D4RzqW9cDY+PS79HL6FyuQ+Z66DPp5+OD8yjRi/TTEQQBFfb75MR+C+cdNOPkT9yr/GXVa+XEBCvTvUOz8/U4o/IAFqvysrOT97m1S+rEXkPiKvgz5bzV++PWhyu2GKgL7pZRU+ugKYvHXMBr/z/Ac/x5TOPgoY5r7ZBNi/TSRSPkxrxj75l44/oV+wPtoZ6b8YiAQ/LiKaP93Uh7ta8Ki/L24XvpR9lTz4YQC9W5CwPtt2LT65LsG///8ZP+cjyT7IlII/2SILQEH44T6ziAw+ymwPPwq1yD6zrLw+l6wBv50Vzr4+bgo/DmYaPswGjT6W9ns+mAt7vjjm/T0I13o/GZCMu44Zrj2yna49NZcSPw=="],"bias":["pqTnvhS+Eb9NtQa/J1nzvsesEL+XILE/SAy3PxvhrD8KEaA/vVGYP8lCaryx5x0+54qLPfnQPTwXP4W91vwFPsS2mj0vw1i3gehgvjKLFT8="]},"dense_284":{"weights":["IOS6vzz+uz7HOoy/2WasPwCuyD8wKsa+t2bSv1zXwj7CxJc/Vjlyv7Biqb8jx1A/cJqIvxMKYj/3HKk/Kmuavwt3/L5ElFM/PgQHPywenr/TPri+XHVgPwlNmL+4V5E/c7u2P2uqzb7HdMK+9o9LP6mUhj9EEH+/Yl10vztLoD//bli/Yyu+P6aIrj/w1W6/576cv6IsjT8vpzk/bjuZv8cAb79kAiw//hWIv2khjj5geWQ+W6Nkv7cnj79J23s/w+yCP+3fCr8="],"bias":["9PCYvnqGnz97CES/WPM0PytxAj8TSqW+pRQsv3546TzAiK4+XuUmvw=="]},"dense_285":{"weights":["J0A+wcidGkH4kxvBG/0qQYFxLEFktivBzeA4wW/8L0GR8zhBX+4kwQ=="],"bias":["plcXQQ=="]}},"hash":"1fd1d8839d49a58aa54bd6c3e9343d8cf76a420c1ca30f01f3a0d7905333a9ad"}