{"architecture":{"class_name":"Functional","config":{"name":"Preprocessor","trainable":true,"layers":[{"module":"keras.layers","class_name":"InputLayer","config":{"batch_input_shape":[null,4],"dtype":"float32","sparse":false,"ragged":false,"name":"Input_layer"},"registered_name":null,"name":"Input_layer","inbound_nodes":[]},{"module":"keras.layers","class_name":"Normalization","config":{"name":"Normalization_layer1","trainable":true,"dtype":"float32","axis":[-1],"invert":false,"mean":[-0.40872656825989434,36.953709077789455,37.025122903888686,-54.46045114433167],"variance":[46.3169321090968,77.06982690690923,88.67952173307891,136090.0993860645]},"registered_name":null,"build_config":{"input_shape":[null,4]},"name":"Normalization_layer1","inbound_nodes":[[["Input_layer",0,0,{}]]]},{"module":"keras.layers","class_name":"InputLayer","config":{"batch_input_shape":[null,4,4],"dtype":"float32","sparse":false,"ragged":false,"name":"cov_matrix"},"registered_name":null,"name":"cov_matrix","inbound_nodes":[]},{"module":"keras.layers","class_name":"Dot","config":{"name":"Dot_Layer","trainable":true,"dtype":"float32","axes":[1,2],"normalize":false},"registered_name":null,"build_config":{"input_shape":[[null,4],[null,4,4]]},"name":"Dot_Layer","inbound_nodes":[[["Normalization_layer1",0,0,{}],["cov_matrix",0,0,{}]]]},{"module":"keras.layers","class_name":"Normalization","config":{"name":"Normalization_layer2","trainable":true,"dtype":"float32","axis":[-1],"invert":false,"mean":[6.420063307625495e-17,7.133403675139439e-18,5.706722940111551e-17,1.4266807350278878e-17],"variance":[1.7742364468087257,1.0073858657297345,0.8308172198722376,0.38756046758932655]},"registered_name":null,"build_config":{"input_shape":[null,4]},"name":"Normalization_layer2","inbound_nodes":[[["Dot_Layer",0,0,{}]]]}],"input_layers":[["Input_layer",0,0],["cov_matrix",0,0]],"output_layers":[["Normalization_layer2",0,0]]},"keras_version":"2.13.1","backend":"tensorflow"},"image_data_format":"channels_last","input_shapes":[[4],[4,4]],"output_shapes":[[4]],"tests":[{"inputs":[{"shape":[4],"values":["9VykvoWUeb/bWRW/qV9+vw=="]},{"shape":[4,4],"values":["0g+Rv9xN+L6S8ye/VGMLvyMxFL+Ihpq9PMwcv7s9Az/pTuc/6TgfP05pQb4ujqu/28kdP2rGwL9Mb8S9O8EFPw=="]}],"outputs":[{"shape":[4],"values":["7xFeQCoGNUAwtxPA3jkzQQ=="]}]}],"trainable_params":{"Normalization_layer1":{"mean":["nETRvpnQE0K6GRRCgddZwg=="],"variance":["ikQ5QsAjmkLqW7FChuYESA=="]},"Normalization_layer2":{"mean":["XQmUJIyWAyOMloMkjJaDIw=="],"variance":["LhrjPwXygD9wsFQ/U27GPg=="]}},"hash":"323fa37417be273fb7b1deb7097bb6a7a14816838a96704ca588f22b90e217e0"}